tap "homebrew/bundle"
tap "homebrew/services"
brew "awk"
brew "openssl@3"
brew "readline"
brew "cmake"
brew "curl"
brew "gh"
brew "git"
brew "gmp" # work
brew "imagemagick" # work
brew "jq"
brew "libsodium" # work
brew "libxml2" # work
brew "libyaml" # work
brew "mysql@8.4", restart_service: true # work
brew "node@20" # work
brew "openssl@1.1" # work
brew "pv" # work
brew "ruby-build" # work
brew "rbenv" # work
brew "wget"
brew "yarn" # work
cask "authy"
cask "bluesnooze"
cask "brave-browser"
cask "caffeine"
cask "iterm2"
cask "microsoft-auto-update" # work
cask "microsoft-teams" # work
cask "orbstack"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
vscode "balastrong.close-tabs"
vscode "bradzacher.vscode-copy-filename"
vscode "ciebiada.ruby-copy-reference"
vscode "eamodio.gitlens"
vscode "ezforo.copy-relative-path-and-line-numbers"
vscode "gimenete.github-linker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "jtcontreras90.yaml-path-extractor"
vscode "koichisasada.vscode-rdbg"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "zhang-renyang.vscode-react"
vscode "zwyx.autoclosetabs"
